_posts/2015-06-27-Magit-Notes.html
---
layout: post
title: Magit文档笔记
description: [阅读Magit文档的笔记, 记录常用的magit使用方法]
category: [Emacs]
---

<p>
(持续更新)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">v2.1.0</h2>
<div class="outline-text-2" id="text-1">
<p>
v2.1.0于2015年7月1日发布, 该版本的主要更新: <a href="https://raw.githubusercontent.com/magit/magit/master/Documentation/RelNotes/2.1.0.txt">https://raw.githubusercontent.com/magit/magit/master/Documentation/RelNotes/2.1.0.txt</a>
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">升级</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>该版本依赖的其他软件的最小版本: &gt;=Emacs24.4, &gt;=git1.9.4.
</li>
<li>由于改动较大, 所以建议先删除旧版本.
</li>
<li>由于不在依赖git-commit-mode和git-rebase-mode, 所以建议删除这两个package.
</li>
<li>操作完成后, 重启安装新包.
</li>
</ol>
<pre class="example">
 Archive: n/a
 Version: 20150806.1658
Requires: emacs-24.4, dash-2.10.0, with-editor-2.1.0, git-commit-2.1.0,
            magit-popup-2.1.0
 Summary: A Git porcelain inside Emacs
Homepage: https://github.com/magit/magit
Keywords: git tools vc 
 Other versions: 20150806.1658 (melpa).
</pre>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">note</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>在magit中disable evil-mode
<div class="org-src-container">

<pre class="src src-lisp">(require 'evil)
(evil-mode 1)
(evil-set-initial-state 'magit-popup-mode 'emacs)
(evil-set-initial-state 'magit-mode 'emacs)
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">快捷键:</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>删除branch: b -&gt; v -&gt; k, 输入要删除的branch名.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">v1.4</h2>
<div class="outline-text-2" id="text-2">
<p>
Magit 1.4版本文档地址 <a href="http://magit.vc/manual/1.4/magit/index.html#Top">http://magit.vc/manual/1.4/magit/index.html#Top</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Magit功能学习</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Sections</h3>
<div class="outline-text-3" id="text-3-1">
<p>
所有的Magit buffer都是通过 sections 的形式组织的, 每个section还可以包含子section.在一个magit buffer中, 这些
sections可以独立的被显示和隐藏.当一个section被隐藏的时候,只会显示该section的
第一行.
</p>

<p>
section操作的快捷键:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Short Keys</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">TAB</td>
<td class="left">快速显示/隐藏当前 section</td>
</tr>

<tr>
<td class="left">S-TAB</td>
<td class="left">快速显示/隐藏当前 section 的 <b>子</b> section</td>
</tr>

<tr>
<td class="left">1/2/3/4</td>
<td class="left">显示 &lt;=N 的section, 例如按2,会显示 <b>当前</b> level 1和 level 2的section,隐藏level 3, level 4 的section</td>
</tr>

<tr>
<td class="left">M-1/2/3/4</td>
<td class="left">同上, 但是显示所有相关section</td>
</tr>

<tr>
<td class="left">M-h</td>
<td class="left">隐藏(有些buffer功能跟2相同, 有些不一定)</td>
</tr>

<tr>
<td class="left">M-H</td>
<td class="left">隐藏 <b>所有</b> (同上)</td>
</tr>

<tr>
<td class="left">M-s</td>
<td class="left">显示(有些buffer功能跟4相同, 有些不一定)</td>
</tr>

<tr>
<td class="left">M-S</td>
<td class="left">显示所有(同上)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">其他快捷键/配置</h3>
<div class="outline-text-3" id="text-3-2">
<p>
注: <i>当快捷键操作于section头部时, 会影响所有的文件.</i>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Buffer</th>
<th scope="col" class="left">Short Keys</th>
<th scope="col" class="left">Note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Status</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">magit-repo-dirs</td>
<td class="left">可以在.emacs文件中配置此变量, 设置调用magit-status命令打开的git库</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">g</td>
<td class="left">refresh buffer</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">s/S</td>
<td class="left">把文件加入到stage area/只把所有changes加入到stage area</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">C-u S</td>
<td class="left">把所有文件加入到stage area</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">i</td>
<td class="left">添加该文件到 .gitignore</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">C-u i</td>
<td class="left">手写添加到 .gitignore的文件名</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">k</td>
<td class="left">discard</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">u/U</td>
<td class="left">unstage file/all file</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">c c + C-c C-c</td>
<td class="left">提交</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">C-c C-k</td>
<td class="left">放弃提交</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">l l</td>
<td class="left">show history</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">l r l</td>
<td class="left">显示范围</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">t t</td>
<td class="left">create tag</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">x/X</td>
<td class="left">重置head/重置head(清空working area和stage area)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">z + z/a/A</td>
<td class="left">创建/应用/弹出 stash</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">z -k z</td>
<td class="left">创建stash,但是保留working area和stage area</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">b</td>
<td class="left">branch related</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">w</td>
<td class="left">显示所有branch和当前branch的关系</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">m</td>
<td class="left">merge</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">R</td>
<td class="left">Rebase</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">P</td>
<td class="left">push</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">f</td>
<td class="left">fetch</td>
</tr>

<tr>
<td class="left">history</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">RET/SPC/DEL</td>
<td class="left">show commit detail in new buffer(commit buffer)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">a</td>
<td class="left">将当前提交应用到当前branch, 需手动提交</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">A</td>
<td class="left">&#x2026;自动提交</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">v</td>
<td class="left">revert commit</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">.</td>
<td class="left">mark a commit</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">=</td>
<td class="left">show diff from current commit to marked</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">l h</td>
<td class="left">reflog</td>
</tr>

<tr>
<td class="left">commit</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">a</td>
<td class="left">把当前section应用到当前branch</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">v</td>
<td class="left">reverse the patch</td>
</tr>

<tr>
<td class="left">diff</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
